<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <title>Introducción a p5.js</title>
    
    <link rel="stylesheet" href="assets/html.css">

  </head>
  <body data-type="book">
    <div class="container">
      <section data-type="chapter" id="capitulo_02_empezando_a_programar">

<h1>Cap&#xED;tulo 2. Empezando a programar</h1>

<a data-primary="empezando a programar" data-type="indexterm"></a>

<p>
Para sacar el m&#xE1;ximo provecho de este libro, no basta con solo leerlo. Necesitas experimentar y practica. No puedes aprender a programar solamente leyendo - debes hacerlo. Para empezar, descarga p5.js y haz tu primer bosquejo.
</p>

<h2>Ambiente</h2>

Primero, necesitar&#xE1;s un editor de c&#xF3;digo. Un editor de c&#xF3;digo es similar a un editor de texto (como Bloc de notas), excepto que tiene una funcionalidad especial para editar c&#xF3;digo en vez de texto plano. Puedes usar cualquier editor que quieras, te recomendamos Atom y Brackets, ambos disponibles para descarga.
Tambi&#xE9;n existe un editor oficial de p5.js en desarrollo. Si lo quieres usar, lo puedes descargar visitando http://p5js.org/download y seleccionando el bot&#xF3;n que dice &quot;Editor&quot;. Si est&#xE1;s usando el editor de p5.js, puedes saltar a la secci&#xF3;n &quot;Tu primer programa&quot;.

<h2>Descarga y configuraci&#xF3;n de archivos</h2>

Empieza por visitar http://p5js.org/download y selecciona &quot;p5.js complete&quot;. Tras la descarga, haz doble click en el archivo .zip y arrastra el directorio a alguna ubicaci&#xF3;n en tu disco duro. Puede ser Archivos de programa o Documentos o simplemente tu Escritorio, pero lo importante es que el directorio p5 sea extra&#xED;do de este archivo .zip.
El directorio p5 contiene un proyecto de ejemplo con el que puedes empezar a trabajar. Abre tu editor de c&#xF3;digo. Luego abre el directorio llamado &quot;empty-example&quot; en tu editor de c&#xF3;digo. En la mayor&#xED;a de los editores de c&#xF3;digo, puedes hacer esto seleccionando en el men&#xFA; Archivo la opci&#xF3;n Abrir, y luego seleccionando &quot;empty-example&quot;. &#xA1;Ahora est&#xE1;s listo para empezar tu primer programa!

<h2>Tu primer programa</h2>

Cuando abras el directorio &quot;empty-example&quot;, lo m&#xE1;s probable es que veas una barra lateral con el nombre del directorio en la parte superior y una lista con los archivos contenidos en este directorio. Si haces click en alguno de estos archivos, ver&#xE1;s los contenidos del archivo aparecer en el &#xE1;rea principal.

Un bosquejo en p5.js est&#xE1; compuesto de unos cu&#xE1;ntos lenguajes distintos usados en conjunto. HTML (HyperText Markup language) brinda la columna vertebral, enlazando todos los otros elementos en la p&#xE1;gina. Javascript (y la librer&#xED;a p5.js) te permiten crear gr&#xE1;ficas interactivas que puedes mostrar en tu p&#xE1;gina HTML. A veces CSS (Cascading Style Sheets) es usado para definir elementos de estilo en la p&#xE1;gina HTML, pero no cubriremos esta materia en este libro.

Si revisas el archivo index.html, te dar&#xE1;s cuenta que contiene un poco de c&#xF3;digo HTML. Este archivo brinda la estructura a tu projecto, uniendo la librer&#xED;a p5.js y otro archivo llamado sketch.js, donde t&#xFA; escribiras tu propio programa. El c&#xF3;digo que crea estos enlaces tiene esta apariencia:

<pre data-code-language="javascript" data-type="programlisting">
<script language="javascript" type="text/javascript" src="../p5.js"></script>
<script language="javascript" type="text/javascript" src="sketch.js"></script>
</pre>

No necesitas hacer nada en el c&#xF3;digo HTML en este momento - ya est&#xE1; configurado para ti. Luego, haz click en sketch.js y revisa el c&#xF3;digo:

<script type="text/p5" data-autoplay="" data-preview-width="400">
function setup() {
  // put setup code here
}

function draw() {
  // put drawing code here
}
</script>

<div class="codesplit"><div class="pairs"><div class="pair no-comment"><div class="code">

<pre><code>

</code></pre></div></div></div></div>

<p> El c&#xF3;digo plantilla contiene dos bloques, o funciones, setup() y draw(). Puedes poner tu c&#xF3;digo en cualquiera de los dos lugares, y cada uno tiene un prop&#xF3;sito espec&#xED;fico. </p>

<p>Cualquier c&#xF3;digo que est&#xE9; involucrado en la definici&#xF3;n del estado incial de tu programa corresponde al bloque setup(). Por ahora, lo dejaremos vac&#xED;o, pero m&#xE1;s adelante en el libro, a&#xF1;adir&#xE1;s c&#xF3;digo aqu&#xED; para especificar el tama&#xF1;o de tu lienzo para tus gr&#xE1;ficas, el peso de tu trazado o la velocidad de tu programa.</p>

<p>Cualquier c&#xF3;digo involucrado en realmente dibujar contenido a la pantalla (definir el color de fondo, dibujar figuras, texto o im&#xE1;genes) ser&#xE1; colocado en el bloque draw(). Es aqu&#xED; donde empezar&#xE1;s a escribir tus primeras l&#xED;neas de c&#xF3;digo.</p>


<h2>Ejemplo 2-1: dibuja una elipse</h2>

Entre las llaves del bloque draw(), borra el texto //put drawing code here y reempl&#xE1;zalo con el siguiente:

<div class="codesplit"><div class="pairs"><div class="pair no-comment"><div class="code">

<pre><code>

</code></pre></div></div></div></div>

Tu programa entero deber&#xE1; verse as&#xED;:

Esta nueva l&#xED;nea de c&#xF3;digo significa &quot;dibuja una elipse, con su centro 50 pixeles a la derecha desde el extremo izquierdo y 50 pixeles hacia abajo desde el extremo superior, con una altura y un ancho de 80 pixeles&quot;. Graba el c&#xF3;digo presionando Command-S, o desde el men&#xFA; con File-Save.

Para ver el c&#xF3;digo corriendo, puedes abrir index.html en cualquier navegador web (como Chrome, Firefox o Safari). Navega al directorio &quot;empty-example&quot; en tu explorador de archivos y haz doble click en index.html para abrirlo. Otra alternativa es desde el navegador web, escoger Archivo-Abrir y seleccionar el archivo index.html.

Si has escrito todo correctamente, deber&#xED;as ver un c&#xED;rculo en tu navegador. Si no lo ves, aseg&#xFA;rate de haber copiado correctamente el c&#xF3;digo de ejemplo. Los n&#xFA;meros tienen que estar entre par&#xE9;ntesis y tener comas entre ellos. La l&#xED;nea debe terminar con un punto coma.

Una de las cosas m&#xE1;s dif&#xED;ciles sobre empezar a programar es que tienes que ser muy espec&#xED;fico con la sintaxis. El software p5.js no es siempre suficientemente inteligente como para entender lo que quieres decir, y puede ser muy exigente con la puntuaci&#xF3;n. Te acostumbrar&#xE1;s a esto con un poco de pr&#xE1;ctica.

A continuaci&#xF3;n, avanzaremos para hacer esto un poco m&#xE1;s emocionante.

<h2>Ejemplo 2-2: hacer c&#xED;rculos</h2>

Borra el texto del ejemplo anterior, y prueba este. Graba tu c&#xF3;digo, y refresca (Command-R) index.html en tu navegador para verlo actualizado.

Este programa crea un lienzo para gr&#xE1;ficas que tiene un ancho 480 pixeles y una altura de 120 pixeles, y luego empieza a dibujar c&#xED;rculos blancos en la posici&#xF3;n de tu rat&#xF3;n. Cuando presionas un bot&#xF3;n del rat&#xF3;n, el color del c&#xED;rculo cambia a negro. Explicaremos despu&#xE9;s y en detalle m&#xE1;s de los elementos de este programa. Por ahora, corre el c&#xF3;digo, mueve el rat&#xF3;n y haz click para experimentarlo.

<h2>La consola</h2>

El navegador web tiene incluida una consola que puede ser muy &#xFA;til para depurar programas. Cada navegador tiene una manera diferente de abrir la consola. Aqu&#xED; est&#xE1;n las instrucciones sobre c&#xF3;mo hacerlo con los navegadores m&#xE1;s t&#xED;picos:

Para abrir la consola en Chrome, desde el men&#xFA; superior escoge View-Developer-Javascript Console

Con Firefox, desde el men&#xFA; superior escoge Tools-Web-Developer-Web Console.

Usando Safari, necesitar&#xE1;s habilitar la funcionalidad antes de que puedas usarla. Desde el men&#xFA; superior, selecciona Preferencias y luego haz click en la pesta&#xF1;a Avanzado y activa la casilla &quot;Show develop menu in menu bar&quot;. Tras hacer esto, ser&#xE1;s capaz de seleccionar Develop-Show Error Console.

En Internet Explorer, abre F12 Developer Tools, luego selecciona Console Tool.

Deber&#xED;as ahora ver un recuadro en la parte inferior o lateral de tu pantalla. Si hay un error de digitaci&#xF3;n, aparecer&#xE1; texto rojo explicando qu&#xE9; error es. Este texto puede a veces ser cr&#xED;ptico, pero si revisas al lado derecho de la l&#xED;nea, estar&#xE1; el nombre del archivo y el n&#xFA;mero de la l&#xED;nea de c&#xF3;digo donde fue detectado el error. Ese es un lugar adecuado donde empezar a buscar errores en tu programa.

<h2>Creando un nuevo proyecto</h2>

Haz creado un bosquejo desde un ejemplo vac&#xED;o, &#xBF;pero c&#xF3;mo creas un nuevo proyecto? La manera m&#xE1;s f&#xE1;cil de hacerlo es ubicando el directorio &quot;empty-example&quot; en tu explorador de archivos y luego copiar y pegarlo para crear un segundo &quot;empty-example&quot;. Puedes renombrar la carpeta a lo que quieras - por ejemplo, Proyecto 2.

Ahora puedes abrir este directorio en tu editor de c&#xF3;digo y empezar a hacer un nuevo bosquejo. Cuando quieras verlo en el navegador, abre el archivo index.html dentro de tu nuevo directorio Proyecto 2.

Siemrpe es una buena idea grabar tus bosquejos frecuentemente. Mientras est&#xE1;s probando cosas nuevas, graba tu bosquejo con diferentes nombres (Archivo-Guardar como), para que as&#xED; siempre seas capaz de volver a versiones anteriores. Esto es especialmente &#xFA;til si - o cuando - algo se rompe.

<h2>Nota</h2>

Un error com&#xFA;n es estar editando un proyecto pero estar viendo otro en el navegador web, haciendo que no puedas ver los cambios que has hecho. Si te das cuenta que tu programa se ve igual a pesar de haber hecho cambios a tu c&#xF3;digo, revisa que est&#xE1;s viendo el archivo index.html correcto.

<h2>Ejemplos y referencia</h2>

Aprender c&#xF3;mo programar con p5.js involucra explorar mucho c&#xF3;digo: correr, alterar, romper y mejorarlo hasta que lo hayas reformulado en algo nuevo. Con esto en mente, el sitio web de p5.js tiene docenas de ejemplos que demuestran diferentes caracter&#xED;sticas de la librer&#xED;a. Visita la pag&#xED;na de Ejemplos para verlos. Puedes jugar con ellos editanto el c&#xF3;digo en la p&#xE1;gina y luego haciendo click en &quot;Run&quot;. Los ejemplos est&#xE1;n agrupados en distintas categor&#xED;as seg&#xFA;n su funci&#xF3;n, como Forma, color, e imagen. Encuentra un tema que te interese en la lista y prueba un ejemplo.

Si ves una parte del programa con la que no est&#xE1;s familiarizado o sobre la que quieres aprender su funcionalidad, visita la referencia de p5.js.

La referencia de p5.js explica cada elemento de c&#xF3;digo con una descripci&#xF3;n y ejemplos. Los programas en la Referencia son mucho m&#xE1;s cortos (usualmente cuatro o cinco l&#xED;neas) y m&#xE1;s f&#xE1;ciles de seguir que los ejemplos de la p&#xE1;gina Learn. Ten en cuenta que estos ejemplos usualmente omiten setup() y draw() por simplicidad, pero estas l&#xED;neas de c&#xF3;digo que ves deber&#xE1;n ser puestas dentro de uno de estos bloques para poder se ejecutadas. Recomendamos mantener la p&#xE1;gina de Referencia abierta mientras est&#xE1;s leyendo este libro y mientras est&#xE1;s programando. Puede ser navegada por tema o usando la barra de b&#xFA;squeda en la parte superior de la p&#xE1;gina.

La Referencia fue escrita con el principiante en mente, esperamos que sea clara y entendible. Estamos muy agradecidos de las personas que han visto errores y los han se&#xF1;alado. Si crees que puedes mejorar una entrada en al referencia o que has encontrado alg&#xFA;n error, por favor haznos saber esto haciendo click en el link en la parte inferior de la p&#xE1;gina de referencia.

</section>

<a id="prev-link" href="chapter01.html">Previous: Capítulo 1. Hola </a>

<a id="next-link" href="chapter03.html">Next: Capítulo 3. Dibuja</a>
    </div>
  </body>
</html>
